[
    {
      "title": "The Mystery of the Four Fingers",
      "publishedDate": "1908",
      "description": "His whole attention was now concentrated upon Fenwick, who presently tilted his glass of Curacoa dexterously into his coffee cup, and then stretched out his hand for the silver match box by his side. He was still talking to his companion while he fumbled for a match without looking at the little case in his hand. Suddenly he ceased to speak, his black eyes rivetted on the box. It fell from his fingers as if it had contained some poisonous insect, and he rose to his feet with a sudden scream that could be heard all over the room.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=-qQcAAAAMAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 120,
      "author": "Fred Merrick White"
    },
    {
      "title": "R is for Ricochet",
      "publishedDate": "2009-09-18",
      "description": "R is for Ricochet is the eighteenth in the Kinsey Millhone mystery series by Sue Grafton. Kinsey Millhone, employed by Nord Lafferty to drive his daughter home from her incarceration at the Californian Institute for Women, marvels at the simplicity of the task. But Reba Lafferty emerges feisty and rebellious, and Kinsey is soon fighting to prevent her charge from breaking the conditions of her parole. As she finds herself befriending the ex-gambler, ex-alcoholic and ex-con, Kinsey discovers that Reba had taken the fall for her boss, also her lover, when he conducted a highly-crafted money laundering scam. Alan Beckwith has so far escaped the clutches of the FBI. Now they believe he is laundering money for a Columbian drug cartel - they just need the proof. When Kinsey is asked by the police to persuade Reba to unveil crucial evidence guaranteed to put Beckwith behind bars, she doesn’t expect cooperation. But when she hears of shocking new information about her lover, Reba is suddenly all too eager to do everything she can to ruin him. Embroiled in a cunning challenge of wits, and meanwhile bemused by her own blossoming romance, Kinsey must try to control the bitter, angry Reba as she launches her dangerous revenge . . .",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=bHrMLG5UAdgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 121,
      "author": "Sue Grafton"
    },
    {
      "title": "None Shall Sleep",
      "publishedDate": "2020-09-01",
      "description": "The Silence of the Lambs meets Sadie in this riveting psychological thriller about two teenagers teaming up with the FBI to track down juvenile serial killers. In 1982, two teenagers—serial killer survivor Emma Lewis and US Marshal candidate Travis Bell—are recruited by the FBI to interview convicted juvenile killers and provide insight and advice on cold cases. From the start, Emma and Travis develop a quick friendship, gaining information from juvenile murderers that even the FBI can't crack. But when the team is called in to give advice on an active case—a serial killer who exclusively hunts teenagers—things begin to unravel. Working against the clock, they must turn to one of the country's most notorious incarcerated murderers for help: teenage sociopath Simon Gutmunsson. Despite Travis's objections, Emma becomes the conduit between Simon and the FBI team. But while Simon seems to be giving them the information they need to save lives, he's an expert manipulator playing a very long game...and he has his sights set on Emma. Captivating, harrowing, and chilling, None Shall Sleep is an all-too-timely exploration of not only the monsters that live among us but also the monsters that live inside us.",
      "categories": [
        "Young Adult Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=b3HIDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 122,
      "author": "Ellie Marney"
    },
    {
      "title": "The Mystery of the Missing Letter R",
      "publishedDate": "2014-08-04",
      "description": "",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=LtVOBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 123,
      "author": "Judy Kerr"
    },
    {
      "title": "Mystery Walk",
      "publishedDate": "2011-10-18",
      "description": "An “impressive” tale of psychic power, Native American mysticism, and an ancient evil in Alabama, from the New York Times–bestselling author of Swan Song (Associated Press). Born and raised in rural Alabama, Billy Creekmore was destined to be a psychic. His mother, a Choctaw Indian schooled in her tribe’s ancient mysticism, understands the permeable barrier between life and death—and can cross it. She taught the power to Billy and now he helps the dead rest in peace. Wayne Falconer, son of one of the most fervent tent evangelists in the South, travels the country serving his father’s healing ministry. Using his unique powers to cure the flock, Little Wayne is on his way to becoming one of the popular and successful miracle workers in the country. He helps the living survive. Billy and Wayne share more than a gift. They share a dream—and a common enemy. They are on separate journeys, mystery walks that will lead them toward a crossroad where the evil of their dreams has taken shape. One of them will reject the dark. The other will be consumed by it. But neither imagined just how monstrous and far-reaching the dark was, or that mankind’s fate would rest in their hands during an epic showdown of good versus evil. From the author of Gone South, Boy’s Life, and the Matthew Corbett series, a master of suspense who has won the World Fantasy and Bram Stoker Awards, Mystery Walk offers “creepy, subtle touches throughout [and] splendid Southern-town atmosphere” (Kirkus Reviews).",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=gdWyRTRvtIcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 124,
      "author": "Robert McCammon"
    },
    {
      "title": "The Notting Hill Mystery",
      "publishedDate": "2020-08-24",
      "description": "Source documents compiled by insurance investigator Ralph Henderson are used to build a case against Baron \"R___\", who is suspected of murdering his wife. The baron's wife died from drinking a bottle of acid, apparently while sleepwalking in her husband's private laboratory. Henderson's suspicions are raised when he learns that the baron recently had purchased five life insurance policies for his wife. As Henderson investigates the case, he discovers not one but three murders. Although the baron's guilt is clear to the reader even from the outset, how he did it remains a mystery. Eventually this is revealed, but how to catch him becomes the final challenge; he seems to have committed the perfect crime.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=ItxhEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 125,
      "author": "Charles Felix"
    },
    {
      "title": "Greek Fiction",
      "publishedDate": "2013-11-19",
      "description": "First published in 1994. Routledge is an imprint of Taylor & Francis, an informa company.",
      "categories": [
        "History"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=gckeAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 126,
      "author": "]. R. Morgan"
    },
    {
      "title": "Mystery Mechanics, The Creative Process",
      "publishedDate": "2020-08",
      "description": "",
      "categories": [
        "Art"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=R-CuzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 127,
      "author": "Andy Wilkinson"
    },
    {
      "title": "The Jacob Street Mystery",
      "publishedDate": "2017-12-20",
      "description": "A peaceful, pleasant afternoon in the woodland scene of Linton Green is disturbed when a brutal murder takes place. But thanks to an unseen witness, the killer may be caught, and the witness turns out to be a blessing in disguise. This is the story of Thomas Pedley, a gifted artist who paints what he sees from memory.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=3Ld4DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 128,
      "author": "R. Austin Freeman"
    },
    {
      "title": "Mystery of the Haunted Hut",
      "publishedDate": "1969",
      "description": "",
      "categories": [
        "Detective and mystery stories"
      ],
      "price": 600,
      "quantity": 100,
      "image": "noimg",
      "id": 129,
      "author": "Mary Graham Bonner"
    },
    {
      "title": "Critical Survey of Mystery and Detective Fiction: Pot-Z",
      "publishedDate": "1988",
      "description": "Presents critical studies of more than 290 authors of detective and mystery fiction from around the world dating from the mid-eighteenth century to the present day.",
      "categories": [
        "Authors"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=jMRWAAAAYAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 130,
      "author": "Frank Northen Magill"
    },
    {
      "title": "X, Y, Z, T",
      "publishedDate": "2004-01-01",
      "description": "Damien Broderick has had a major impact as an Australian SF writer since 1964. He is undoubtedly the leading Australian theorist of the SF genre' (Russell Blackford, Van Ikin, Sean McMullen, Strange Constellations). Now, Broderick draws upon his skills as both critic and novelist to analyze science fiction of the last two decades, and its earlier roots. The book proposes sf as a distinctive form of writing, the extreme narrative of difference, then closely reads authors such as John Barnes, Jamil Nasir, Wil McCarthy, Robert Grossbach and Poul Anderson. While concentrating on exciting work published in the USA and Britain, Broderick does not neglect his own country's contributions, discussing sf by George Turner and other Australians. His critical voice is wry, entertaining and occasionally scathing.",
      "categories": [
        "Literary Criticism"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=uJyXcehjHCAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 131,
      "author": "Damien Broderick"
    },
    {
      "title": "The Encyclopedia of Science Fiction",
      "publishedDate": "1979",
      "description": "",
      "categories": [
        "Science fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=NzAqAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 132,
      "author": "Peter Nicholls"
    },
    {
      "title": "Mystery Flowers",
      "publishedDate": "2019-08-09",
      "description": "After her mother died, lovely Diana sought comfort in prayer and in the single flower a mysterious person dropped daily on her pathway. Touched by anonymous gifts of flowers, Diana wonders who the mystery giver is. Can it be that he knows of her despair? and wants to help her?",
      "categories": "",
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=Z-KqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 133,
      "author": "Grace Livingston Hill"
    },
    {
      "title": "The Lost City of Z",
      "publishedDate": "2010-01-26",
      "description": "#1 NEW YORK TIMES BESTSELLER • From the author of Killers of the Flower Moon comes a masterpiece of narrative nonfiction that unravels the greatest exploration mystery of the twentieth century—the story of the legendary British explorer who ventured into the Amazon jungle in search of a fabled civilization and never returned. “Suspenseful…rollicking.” —The New York Times In 1925, Percy Fawcett went into the Amazon jungle, in search of a fabled civilization. He never returned. Over the years countless perished trying to find evidence of his party and the place he called “The Lost City of Z.” In this masterpiece, journalist David Grann interweaves the spellbinding stories of Fawcett’s quest for “Z” and his own journey into the deadly jungle. Look for David Grann’s new book, The Wager, coming in April 2023!",
      "categories": [
        "History"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=QPih33JBeMwC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 134,
      "author": "David Grann"
    },
    {
      "title": "Contemporary American Women Fiction Writers",
      "publishedDate": "2002-11-30",
      "description": "American women writers have long been creating an extraordinarily diverse and vital body of fiction, particularly in the decades since World War II. Recent authors have benefited from the struggles of their predecessors, who broke through barriers that denied women opportunities for self-expression. This reference highlights American women writers who continue to build upon the formerly male-dominated canon. Included are alphabetically arranged entries for more than 60 American women writers of diverse ethnicity who wrote or published their most significant fiction after World War II. Each entry is written by an expert contributor and includes:^L^DBLA brief biography^L^DBLA discussion of major works and themes^^DBLA survey of the writer's critical reception^L^DBLA bibliography of primary and secondary sources",
      "categories": [
        "Literary Criticism"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=BL1ZAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 135,
      "author": "Laurie Champion"
    },
    {
      "title": "A Thousand Pails of Water",
      "publishedDate": "1978-01-01",
      "description": "A small boy's infectious determination saves the life of a whale beached near an oriental whaling village.",
      "categories": [
        "Japan"
      ],
      "price": 600,
      "quantity": 100,
      "image": "noimg",
      "id": 136,
      "author": "Ron Roy"
    },
    {
      "title": "A to Z Mysteries: The Zombie Zone",
      "publishedDate": "2009-09-02",
      "description": "Help Dink, Josh, and Ruth Rose solve mysteries from A to Z in this chapter book that's perfect for Halloween! Kids love collecting the entire alphabet and super editions! With over 8 million copies in print, the A to Z Mysteries® have been hooking chapter book readers on mysteries and reading for years. Now this classic kid favorite is back with a bright new look! Z is for Zombie . . . There’s a zombie on the loose! When Dink, Josh, and Ruth Rose visit the Louisiana bayous, they meet a village with one spooky problem. Locals say a silver-haired zombie is digging up graves in the cemetery. Are the stories real? Dink, Josh, and Ruth Rose will unearth the truth!",
      "categories": [
        "Juvenile Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=bk1PuVZHv0wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 137,
      "author": "Ron Roy"
    },
    {
      "title": "A to Z Mysteries Super Edition #12: Space Shuttle Scam",
      "publishedDate": "2020-03-03",
      "description": "Dink, Josh, and Ruth Rose tackle an out-of-this-world mystery--in the twelfth A to Z Mysteries Super Edition! Mystery takes off in 3. . . 2. . . 1! Dink, Josh, and Ruth Rose are in Florida, visiting a space museum, Alice's Space Shuttle. There, they get to check out cool NASA gear! But someone is sneaking around Alice's house, and not because they want a tour. They want Alice's property! Why? Only Dink, Josh, and Ruth Rose can solve this Jupiter-size mystery! Help Dink, Josh, and Ruth Rose solve mysteries from A to Z! From The Absent Author to The Zombie Zone, there's a mystery for every letter of the alphabet, plus super editions with even more A to Z fun. And don't miss Ron Roy's series for younger readers, Calendar Mysteries!",
      "categories": [
        "Juvenile Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=15mdDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 138,
      "author": "Ron Roy"
    },
    {
      "title": "A to Z Mysteries Super Edition #14: Leopard on the Loose",
      "publishedDate": "2022-03-15",
      "description": "There's something dangerous on the prowl at the San Diego Zoo in this latest addition to the beloved A to Z Mysteries Super Editions! Can you SPOT the mystery? Dink, Josh, and Ruth Rose are visiting the San Diego Zoo. When a rare amur leopard goes missing, everyone is a suspect! Can these expert clue hunters find out how the leopard got loose? Help Dink, Josh, and Ruth Rose solve mysteries from A to Z! From The Absent Author to The Zombie Zone, there's a mystery for every letter of the alphabet, plus super editions with even more A to Z fun. And don't miss Ron Roy's series for younger readers, Calendar Mysteries!",
      "categories": [
        "Juvenile Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=yxg1EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 139,
      "author": "Ron Roy"
    },
    {
      "title": "Twisted Paths",
      "publishedDate": "2013",
      "description": "Gloria Foley turned off the light in the hallway and made her way slowly upstairs to bed. She paused at the doorway of her daughter's bedroom and shook her head. It had been such an emotional day for all of them. She prayed she would have the strength to get them both through these treacherous teenaged years.Slowly turning the knob on the bedroom door, she quietly opened it to check on her sleeping child. Through the narrow opening, she could see the bed was still made and no one was sleeping on it. She opened the door wider and saw the shadow on the far wall and her heart clenched. Screaming, she flung the door open and ran to the figure hanging from the thick electric cord suspended from the ceiling fan. \"No,\" she screamed, as she tried to lift the inert body up to relieve the pressure against her neck. \"Nooooooo!\"The ghost of a teenager who committed suicide twenty years ago is haunting her family's home. Can Mary link that death to the serial suicides of the girls who bullied her when she was alive? And with Gary Copper still on the loose, Mary and Bradley are faced with the challenge of keeping the newest member of their family safe and sound.",
      "categories": [
        "Bullying"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=p99engEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 140,
      "author": "Terri Reid"
    },
    {
      "title": "Resort to Murder",
      "publishedDate": "2009-10-13",
      "description": "Ex-reporter Henrietta \"Henrie 0\" O'Dwyer Collins joins a wedding party in glorious Bermuda -- only to discover that death is an uninvited guest. Warm turquoise waters and balmy ocean breezes do little to ease Henrie O's discomfort at having to attend the wedding of her ex-son-in-law Lloyd to Connor Bailey, a beautiful widow with a dark past and a knack for attracting men. Recently recovered from pneumonia, the retired Pulitzer Prize-winning journalist joins her grandchildren at an elegant oceanfront hotel -- and is soon embroiled in a deadly puzzle that touches everyone connected with the impending union.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=uBnDbUAHYAgC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 141,
      "author": "Carolyn Hart"
    },
    {
      "title": "Impossible to Say",
      "publishedDate": "2002",
      "description": "",
      "categories": [
        "American fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "noimg",
      "id": 142,
      "author": "L. Lamar Nisly"
    },
    {
      "title": "Short Fiction of Flann O'Brien",
      "publishedDate": "2013-08-15",
      "description": "This riotous collection at last gathers together an expansive selection of Flann O'Brien's shorter fiction in a single volume, as well as O'Brien's last and unfinished novel, Slattery's Sago Saga. Also included are new translations of several stories originally published in Irish, and other rare pieces. With some of these stories appearing here in book form for the very first time, and others previously unavailable for decades, Short Fiction is a welcome gift for every Flann O'Brien fan worldwide.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=6OlXEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 143,
      "author": "Flann O'Brien"
    },
    {
      "title": "Mistik",
      "publishedDate": "2012-11-01",
      "description": "Being Different Is Lonely … Until You Find Another Like YouA troubled, seventeen year old boy finally admits to himself he is different from other boys. Marc LeRoux is the finest athlete in his high school, but his abilities go far beyond what he's demonstrated on the gymnastics team. On a lonely walk along the neutral ground (medians are called neutral grounds in New Orleans) not far from his home, Marc is attacked by two men, one with a gun. He turns on the muggers and uses his powers to knock both out and escape. It is exhilarating and he feels good for the first time in a long time.From his mother, he learns the family's secret. Marc is an 'advanced human', a leap in human evolution which gives him super-human strength and magnifies his five senses. He can see, hear, smell, taste, and his sense of touch is better than any human. His sense of balance is most acute.Learning the family's hereditary secret, Marc (of ancient French-Creole ancestry) must give up his dream of college athletics and the Olympics. Torn between two worlds, Marc must learn to live as an 'advanced human' in a world of humans. A freak, someone to be feared, Marc needs to vent his energy. He takes to the rooftops of the New Orleans French Quarter in a super-hero costume and quickly meets another 'advanced human', the beautiful, alluring sixteen year old Alyssa Lupo. The mutual attraction he feels for this haunting girl is challenged by others, those bent on using their powers for evil purposes. The star-crossed romance between Marc and Alyssa is the central focus of the novel.Strong on setting, our tale takes place primarily in the French Quarter, where this young super-hero in a black costume, calling himself MISTIK, prowls the roofs and lacework balconies in search of villains. A teenager, MISTIK's powers are still evolving and he will use them to right wrongs, because he can.Born in New Orleans, O'Neil De Noux is a prolific American writer of novels and short stories. Although much of De Noux's fiction falls under the mystery genre (character-drive crime fiction primarily), he has published stories in many disciplines including mainstream fiction, children and young-adult fiction, science-fiction, suspense, fantasy, horror, western, literary, religious, romance, humor and erotica.In 2007, The Private Eye Writers of America awarded its prestigious SHAMUS AWARD for BEST SHORT STORY to “The Heart Has Reasons” by O'Neil De Noux. The SHAMUS is given annually to recognize outstanding achievement in private eye fiction. De Noux is also the 2009 DERRINGER AWARD winner for BEST NOVELETTE for “Too Wise.” The Derringer Awards are given annually to recognize excellence in the short mystery fiction form.In 2010, De Noux teamed with other artists in the art co-op Big Kiss Productions and published SLICK TIME, followed by collections NEW ORLEANS MYSTERIES, NEW ORLEANS NOCTURNAL, NEW ORLEANS CONFIDENTIAL, NEW ORLEANS PRIME EVIL and BACKWASH OF THE MILKY WAY. De Noux's novel JOHN RAVEN BEAU was named 2011 POLICE BOOK OF THE YEAR by Police-Writers.com, a group that boasts of 1153 state and local law enforcement officials from 485 state and local law enforcement agencies who have written 2504 police books. Earlier in 2012, after six months of intensive research and eighteen months of non-stop writing, O'Neil De Noux published BATTLE KISS, a 320,000 word epic of love and war set against the panorama of the Battle of New Orleans, January 8, 1815. So timely is the book, released as the bicentennial of the War of 1812 arrives, Mr. De Noux received an Artist Services Career Advancement Award from the Louisiana Division of the Arts for his work on BATTLE KISS. Also in 2012, Mr. De Noux's first private eye was published. ENAMORED a novel of obsession and murder, is set in 1950 New Orleans. Another crime novel, BOURBON STREET, set in 1947, was released in 2012.In 2012, O'Neil De Noux was elected Vice-President of the Private Eye Writers of America.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=YeuNkgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 144,
      "author": "O'Neil De Noux"
    },
    {
      "title": "The Queen is Dead",
      "publishedDate": "1994",
      "description": "The fifth Jocelyn O'Rourke mystery finds the actress-sleuth back in her alma mater for a Shakespearean production, filling in after the sudden death of her beloved acting teacher, a death that Jocelyn begins to suspect was not accidental. Tour.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "noimg",
      "id": 145,
      "author": "Jane Dentinger"
    },
    {
      "title": "The Ring O' Bells Mystery",
      "publishedDate": "2009",
      "description": "Barney, Roger, Diane and Snubby love solving mysteries, with the help of Loony the spaniel and Miranda the monkey. When the children go to stay in Ring O' Bells Village, they are eager to explore the secret passage in Ring O' Bells Hall. Is it really a dead end as they have been told, or does it follow the route marked on the old map they find? The Children investigate and hear strange noises. Could there be something hidden in the pasage - or even someone? AUTHOR: Enid Mary Blyton (11August 1897-28 November 1968) was a British children's writer known as both Enid Blyton and Mary Pollock. She was one of the most successful children's storytellers of the twentieth century. She is noted for numerous series of books based on recurring characters and designed for different age groups. Her books have enjoyed popular success in many parts of the world, and have sold over 600 million copies. Blyton is the fifth most translated author worldwide: over 3544 translations of her books were available in 2007 according to UNESCO's Index Translationum she overtook Lenin to get the fifth place and is behind Shakespeare. One of Blyton's most widely known characters is Noddy, intended for early years readers. However, her main forte is the young readers' novels, where children ride out their own adventures with minimal adult help. In this genre, particularly popular series include the Famous Five (consisting of 21 novels, 1942-1963, based on four children and their dog), the Five Find-Outers and Dog, (15 novels, 1943-1961, where five children regularly outwit the local police) as well as the Secret Seven (15 novels, 1949-1963, a society of seven children who solve various mysteries). Her work involves children's adventure stories, and fantasy, sometimes involving magic. Her books were and still are enormously popular in Britain, Malta, India, Pakistan, New Zealand, Sri Lanka, Malaysia, Singapore, and Australia; as translations in the former Yugoslavia, Japan; as adaptations in Arabic; and across most of the globe. Her work has been translated into nearly 90 languages. *",
      "categories": [
        "Adventure fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=VVUMuQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 146,
      "author": "Enid Blyton"
    },
    {
      "title": "The Hoosac Tunnel Murders",
      "publishedDate": "2015-03-12",
      "description": "The Hoosac Tunnel Murders begins when seventeen-year old Ginger O'Leary is driven from her bed in the dead of night by a vision of murder within the depths of the \"bloody pit.\" Terrified by what she has experienced, Ginger could little know that this gift from her ancestors would not only set her on the path of self-discovery, but also a quest to secure justice for the victims. It's 1865 and two Massachusetts railroads are competing for an exclusive route across the state to Troy, New York and the emerging markets of Chicago and the west. However, a mountain range nearly five miles wide at its base blocks completion of the northern route. Since 1852 the plan has been to blast a hole through what engineers called the Hoosac Tunnel and workers sardonically named the \"bloody pit.\" So far, all the project had accomplished was to devour money invested in it, ruin careers of engineers who designed it and kill many of the men who worked on it. When a nitroglycerine blast kills two men and injures one, another accident is assumed. But the haunting of Ginger by souls of the men crushed and ripped apart in the blast told a different story. The injured man may have been a friend, but he was also their murderer! But, why? Just when Constable Captain Charles O'Leary, Constable Sergeant CJ Mulcahy and Ginger are about to get an answer they find an empty cell and are confronted with the probability that some very powerful people did not want that question answered. But, these people haven't met Ginger O'Leary and the power of An Dara Sealladh. They also haven't met Doctor Samuel N. Briggs and his motley crew of almost criminals who assist Ginger, her Da and her two loves in ferreting out the truth.",
      "categories": "",
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=gVlErgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 147,
      "author": "Chris H. Wondoloski"
    },
    {
      "title": "Good Things out of Nazareth",
      "publishedDate": "2019-10-15",
      "description": "A literary treasure of over one hundred unpublished letters from National Book Award-winning author Flannery O'Connor and her circle of extraordinary friends. Flannery O��Connor is a master of twentieth-century American fiction, joining, since her untimely death in 1964, the likes of Hawthorne, Hemingway, and Faulkner. Those familiar with her work know that her powerful ethical vision was rooted in a quiet, devout faith and informed all she wrote and did. Good Things Out of Nazareth, a much-anticipated collection of many of O’Connor’s previously unpublished letters—along with those of literary luminaries such as Walker Percy (The Moviegoer), Caroline Gordon (None Shall Look Back), Katherine Anne Porter (Ship of Fools), Robert Giroux and movie critic Stanley Kauffmann. The letters explore such themes as creativity, faith, suffering, and writing. Brought together, they form a riveting literary portrait of these friends, artists, and thinkers. Here we find their joys and loves, as well as their trials and tribulations as they struggle with doubt and illness while championing their beliefs and often confronting racism in American society during the civil rights era. Praise for Good Things Out of Nazareth “An epistolary group portrait that will appeal to readers interested in the Catholic underpinnings of O'Connor's life and work . . . These letters by the National Book Award–winning short story writer and her friends alternately fit and break the mold. Anyone looking for Southern literary gossip will find plenty of barbs. . . . But there’s also higher-toned talk on topics such as the symbolism in O’Connor’s work and the nature of free will.”—Kirkus Reviews “A fascinating set of Flannery O’Connor’s correspondence . . . The compilation is highlighted by gems from O’Connor’s writing mentor, Caroline Gordon. . . . While O’Connor’s milieu can seem intimidatingly insular, the volume allows readers to feel closer to the writer, by glimpsing O’Connor’s struggles with lupus, which sometimes leaves her bedridden or walking on crutches, and by hearing her famously strong Georgian accent in the colloquialisms she sprinkles throughout the letters. . . . This is an important addition to the knowledge of O’Connor, her world, and her writing.”—Publishers Weekly",
      "categories": [
        "Literary Collections"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=CkNkDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 148,
      "author": "Flannery O'Connor"
    },
    {
      "title": "Six O'Clock Silence",
      "publishedDate": "2018-01-16",
      "description": "An eerie discovery brings danger and painful reminders of a tragic past ... When some workmen dig up a skeleton, Homicide Inspector Rebecca Mayfield finds herself investigating a death that took place years earlier. She never imagines that it will have major repercussions on the lives of people she now cares deeply about, or that it will put each of them in danger. Despite the bitter memories resurrected, as a cop, Rebecca has no choice but to pursue the inquiry wherever it might lead. But that doesn't make it easier, especially when it's clear that the special man in her life, Richie Amalfi, wants her to stop. Dangers abound, moving quickly from warnings to out-and-out attacks. The past is shrouded in mystery, but as the truth begins to emerge, it becomes apparent that one or more people are willing to kill to keep it buried. Yet, Rebecca refuses to abandon the case because the dead, although silent, do speak. And it's her job to listen. This is a mystery you won't want to miss. Join the growing number of Inspector Rebecca Mayfield fans, as the books proceed from One O’Clock Hustle, to Two O’Clock Heist, Three O’Clock Séance, and so on. Once you start them, you’ll find the hours just seem to fly by…",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=-p-kDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 149,
      "author": "Joanne Pence"
    },
    {
      "title": "Anatomy of Murder",
      "publishedDate": "2001",
      "description": "Mystery fiction takes place in a centered world, one whose most distinctive characteristic is motivation (of behavior and signs). Built on a faith in foundations, it insists upon the solidity of social life, the validity of social conventions, and the sanctity of signs. Mystery assures us that motives exist for both words and deeds.\".",
      "categories": [
        "Literary Criticism"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=ZCHTI4gopToC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 150,
      "author": "Carl Darryl Malmgren"
    },
    {
      "title": "M for Mystery",
      "publishedDate": "2011-12-09",
      "description": "12 mystery stories for a satisfying read.� Children smell something fishy in their neighbourhood and before they know it, are on an exciting trail ... The characters are people you might meet around the corner and the incidents are such that can happen to you or your friends one of these days.� Secret papers, sinister crooks, a prowling tiger ... and lots more ! Ages 13 to 16 years",
      "categories": "",
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=FgezMQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 151,
      "author": "Girja Rani Asthana, Manorama Jafa, Nilima Sinha, Ira Saxena, Surekha Panandiker, Girja Rani Asthana, Manorama Jafa, Nilima Sinha, Ira Saxena Deepa Agarwal"
    },
    {
      "title": "A Dangerous Thing",
      "publishedDate": "2021-01-07",
      "description": "Meanwhile, Back at the Ranch... Bookseller Adrien English arrives at Pine Shadow Ranch to find a corpse in his driveway. By the time the local sheriffs arrive, the body has disappeared. What happened to the dead man? Who are the mysterious strangers excavating on Adrien's remote property? And will he ever sort out his problems with LAPD Homicide Detective Jake Riordan?",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=JbMSEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 152,
      "author": "Josh Lanyon"
    },
    {
      "title": "Fatal Shadows",
      "publishedDate": "2021-01-07",
      "description": "When a bookstore owner is accused of murdering his ex-lover, proving his innocence might lead a hard-nosed detective to a fatal attraction… Thirty-five-year-old gay bookseller Adrien English searches for love between the pages. As a sensitive intellectual with a heart condition, his dating life is gathering dust on the shelves. But when police name him the prime suspect in the brutal murder of his friend and employee, Adrien doesn't expect his best hope for romance to be assigned to the case… Detective Jake Riordan is hungry to climb the ranks. All he has to do for a promotion is nail the handsome bookstore owner for an obvious crime of passion. If only he could stop fantasizing about the suspect instead of the \"normal\" wife and family his career demands… As Riordan’s investigation heats up and the suspect insists on his innocence, the detective doubts both Adrien's guilt and his ability to resist the man's understated charms. Can they turn the crime into passion, or will a killer on the loose write The End?",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=F7MSEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 153,
      "author": "Josh Lanyon"
    },
    {
      "title": "The Room by the Lake",
      "publishedDate": "2017-07-01",
      "description": "All she wanted was somewhere to belong. Caitlin never meant to stay so long. But it's strange how this place warps time. Out here, in the middle of nowhere, it's easy to forget about the world outside. It all happened so fast. She was lonely, broke, about to give up. Then she met Jake and he took her to his 'family': a close-knit community living by the lake. Each day she says she'll leave but each night she's back around their campfire. Staring into the flames. Reciting in chorus that she is nothing without them. But something inside her won't let go. A whisper that knows this isn't right. Knows there is danger lurking in that quiet room down by the lake... This is a brilliantly atmospheric psychological suspense novel for readers of Emma Cline's The Girls and The Roanoke Girls. Reviews for The Room by the Lake: 'A beautiful book... I was immediately sucked into the writing' NUDGE BOOK. 'A brilliant psychological drama' ALWAYS TRUST IN BOOKS. 'A fascinating, intense psychological suspense novel [...] that really gets under your skin and haunts your thoughts' RATHER TOO FOND OF BOOKS. 'Fast-paced and full of tension' GO BUY THE BOOK. 'Sinister and haunting. A warning about how far people will go when they are lost and lonely. I highly recommend it' BOOKS OF ALL KINDS.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=t7OfEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 154,
      "author": "Emma Dibdin"
    },
    {
      "title": "Mystery at the Masquerade: An M/M Cozy Mystery",
      "publishedDate": "2021-02-28",
      "description": "Love is in the Salt Sea Air--and So is Murder! Ellery Page, aspiring screenwriter, reigning Scrabble champion, and occasionally clueless owner of the village's only mystery bookstore, the Crow’s Nest, is both flattered and bemused when he’s invited to the annual Marauder’s Masquerade, the best and biggest social event of the season in the quaint seaside village of Pirate’s Cove, Rhode Island. The event is hosted by the wealthy Marguerite Bloodworth-Ainsley—a descendant of the famed pirate Tom Blood. Ellery doesn’t even know Mrs. Bloodworth-Ainsley—nor, it turns out—does Mrs. Bloodworth-Ainsley know him. But Marguerite’s son, Julian wants to know Ellery. Julian, handsome, rich and engaging, is a huge mystery buff. In fact, he’s bought quite a few books at the Crow’s Nest bookstore, but never quite worked up the nerve to ask Ellery out. As his relationship with Police Chief Carson seems to be dead in the water, Ellery is grateful for a little flattering attention from the village’s most eligible bachelor, but any hopes of romance hit the shoals when Julian is accused of murdering his mother’s unlikable second husband during the Masquerade's annual ghost hunt in the family’s spooky cemetery.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=YLASEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 155,
      "author": "Josh Lanyon"
    },
    {
      "title": "The Mystery of M. Felix",
      "publishedDate": "2022-09-16",
      "description": "DigiCat Publishing presents to you this special edition of \"The Mystery of M. Felix\" by B. L. Farjeon. DigiCat Publishing considers every written word to be a legacy of humankind. Every DigiCat book has been carefully reproduced for republishing in a new modern format. The books are available in print, as well as ebooks. DigiCat hopes you will treat this work with the acknowledgment and passion it deserves as a classic of world literature.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=m5CKEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 156,
      "author": "B. L. Farjeon"
    },
    {
      "title": "N or M?",
      "publishedDate": "2012-04-17",
      "description": "It is World War II, and while the RAF struggles to keep the Luftwaffe at bay, Britain faces an even more sinister threat from \"the enemy within\"—Nazis posing as ordinary citizens. With pressure mounting, the intelligence service appoints two unlikely spies, Tommy and Tuppence Beresford. Their mission: to seek out a man and a woman from among the colorful guests at Sans Souci, a seaside hotel. But this assignment is no stroll along the promenade—N and M have just murdered Britain's finest agent and no one at all can be trusted. . . .",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=d3ChtQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 157,
      "author": "Agatha Christie"
    },
    {
      "title": "First Class Murder",
      "publishedDate": "2016-02-25",
      "description": "The third instalment in the bestselling Murder Most Unladylike series; just like the iconic Agatha Christie, Hazel and Daisy have boarded the Orient Express! ----- 'A delight . . . Hazel and Daisy are aboard the Orient Express: cue spies, priceless jewels, a murder and seriously upgraded bun breaks' The Bookseller 'Addictive . . . A rumbustious reworking of Agatha Christie's Orient Express caper' New Statesman ----- Daisy Wells and Hazel Wong are taking a holiday on the world-famous Orient Express - and it's clear that each of their fellow first-class passengers has something to hide. Even more intriguing: there is rumour of a spy in their midst. Then, during dinner, there is a scream from inside one of the cabins. When the door is broken down, a passenger is found murdered, her stunning ruby necklace gone. But the killer has vanished - as if into thin air. Daisy and Hazel are faced with their first ever locked-room mystery - and with competition from several other sleuths, who are just as determined to crack the case.",
      "categories": [
        "Juvenile Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=P7p1CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 158,
      "author": "Robin Stevens"
    },
    {
      "title": "The Mystery of Orcival",
      "publishedDate": "1900",
      "description": "",
      "categories": [
        "Monsieur Lecoq (Fictitious character)"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=M-gQAAAAYAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 159,
      "author": "Emile Gaboriau"
    },
    {
      "title": "The P'town Murders",
      "publishedDate": "2007",
      "description": "Secret agent Brad Fairfax is summoned by a mysterious voice to come to Cape Cod to claim the body of his ex-lover and best friend. On site he discovers that Ross was murdered, the first in a string of four corpses to show up. Victims and suspects have two points in common: they are all connected to a gay guesthouse for wealthy clients where anything is permitted, and most have some connection to Buddhism. Although Brad investigates on his own, his boss at the mysterious agency for which he works feels certain the murderer is implicated in an assassination plot against the Dalai Lama, who is to speak soon in New York's Central Park. The possibility of romance comes with the appearance of a young, blue-haired Buddhist. But Brad will have to learn the meaning of trust and to overcome his irrational bouts of jealousy before there can be any hope of a real connection.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=tc5qRBI6u54C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 160,
      "author": "Jeffrey Round"
    },
    {
      "title": "The Mystery of 31 New Inn",
      "publishedDate": "2007-05-01",
      "description": "",
      "categories": "",
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=p-SMGAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 161,
      "author": "Austin R. Freeman"
    },
    {
      "title": "From Big Bang to Big Mystery",
      "publishedDate": "",
      "description": "",
      "categories": "",
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=p-lesaYKENYC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 162
    },
    {
      "title": "The Mystery of Witch-Face Mountain, and Other Stories",
      "publishedDate": "2016-06-23",
      "description": "Unlike some other reproductions of classic texts (1) We have not used OCR(Optical Character Recognition), as this leads to bad quality books with introduced typos. (2) In books where there are images such as portraits, maps, sketches etc We have endeavoured to keep the quality of these images, so they represent accurately the original artefact. Although occasionally there may be certain imperfections with these old texts, we feel they deserve to be made available for future generations to enjoy.",
      "categories": "",
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=p-09DQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 163,
      "author": "Murfree Mary Noailles"
    },
    {
      "title": "Level P- Fiction- Complete Set",
      "publishedDate": "2015-01-01",
      "description": "",
      "categories": "",
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=oQ8TrgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 164,
      "author": "Steps To Literacy"
    },
    {
      "title": "Apex Magazine Issue 130",
      "publishedDate": "2022-03-02",
      "description": "<p><em>Strange. Beautiful. Shocking. Surreal.</em></p> <p>APEX MAGAZINE is a digital dark science fiction and fantasy genre zine that features award-winning short fiction, essays, and interviews. Established in 2009, our fiction has won several Hugo and Nebula Awards.</p> <p>We publish every other month.</p> <p>Issue 130 contains the following short stories, essays, reviews, and interviews.</p> <p>EDITORIAL<br> Musings from Maryland: Editorial by Lesley Conner</p> <p>ORIGINAL FICTION<br> Nine Theories of Time by Spencer Nitkey<br> To Live and Die in Dixieland by Russell Nichols<br> The First Promise We Break by Risa Wolf<br> Tenure by Devon Mihesuah<br> It Rises and Falls and Rises Again by RJ Taylor<br> Strata by Benjamin Blattberg</p> <p>CLASSIC FICTION<br> An Arc of Electric Skin by Wole Talabi<br> In the Garden of Ibn Ghazi by Molly Tanzer</p> <p>NONFICTION<br> Always and Forever by Milton J. Davis<br> Never Let the Light Go Out by Linda D. Addison</p> <p>REVIEWS<br> Words for Thought: Short Fiction Review by A.C. Wise<br> Book Review: A Spindle Splintered Alix E. Harrow (reviewed by Lesley Conner)<br> Book Review: Sweep of Stars by Maurice Broaddus (reviewed by Tracy Robinson)</p> <p>INTERVIEWS<br> Interview with Author Spencer Nitkey by Andrea Johnson<br> Interview with Author RJ Taylor by Andrea Johnson<br> Interview with Cover Artist JR Slattum by Bradley Powers</p>",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=snlhEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 165,
      "author": "Russell Nichols"
    },
    {
      "title": "French Pastry Murder",
      "publishedDate": "2015",
      "description": "Lucy Stone's trip to Paris to learn culinary secrets from a top French pastry chef takes a turn for the worse when she discovers the chef in a pool of blood and must criss-cross the country to find his killer.",
      "categories": [
        "FICTION"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=p-evoQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 166,
      "author": "Leslie Meier"
    },
    {
      "title": "The Mystery of P-ACC",
      "publishedDate": "2018-06-08",
      "description": "\"Refreshingly honest stories that take you on an emotional adventure through the eyes of an individual with P-ACC. Christine's tenacity and wit prove to us that the only true disabled individuals of this world are the minds of those who lack understanding and empathy.\" Kimberly Oren M.Ed and mother of two specially-abled boys",
      "categories": [
        "Health & Fitness"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=t8dWuAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 167,
      "author": "Christine Seidel"
    },
    {
      "title": "The Missing Fossil Mystery",
      "publishedDate": "1996-01-01",
      "description": "A classroom mystery kids will eagerly dig into.",
      "categories": "",
      "price": 600,
      "quantity": 100,
      "image": "noimg",
      "id": 168,
      "author": "Emily Herman"
    },
    {
      "title": "The Mystery of the Velvet Gown",
      "publishedDate": "1980",
      "description": "",
      "categories": [
        "Belden, Trixie (Fictitious character)"
      ],
      "price": 600,
      "quantity": 100,
      "image": "noimg",
      "id": 169,
      "author": "Kathryn Kenny"
    },
    {
      "title": "Anatomy of Murder",
      "publishedDate": "2001",
      "description": "Mystery fiction takes place in a centered world, one whose most distinctive characteristic is motivation (of behavior and signs). Built on a faith in foundations, it insists upon the solidity of social life, the validity of social conventions, and the sanctity of signs. Mystery assures us that motives exist for both words and deeds.\".",
      "categories": [
        "Literary Criticism"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=ZCHTI4gopToC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 170,
      "author": "Carl Darryl Malmgren"
    },
    {
      "title": "M for Mystery",
      "publishedDate": "2011-12-09",
      "description": "12 mystery stories for a satisfying read.� Children smell something fishy in their neighbourhood and before they know it, are on an exciting trail ... The characters are people you might meet around the corner and the incidents are such that can happen to you or your friends one of these days.� Secret papers, sinister crooks, a prowling tiger ... and lots more ! Ages 13 to 16 years",
      "categories": "",
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=FgezMQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 171,
      "author": "Girja Rani Asthana, Manorama Jafa, Nilima Sinha, Ira Saxena, Surekha Panandiker, Girja Rani Asthana, Manorama Jafa, Nilima Sinha, Ira Saxena Deepa Agarwal"
    },
    {
      "title": "A Dangerous Thing",
      "publishedDate": "2021-01-07",
      "description": "Meanwhile, Back at the Ranch... Bookseller Adrien English arrives at Pine Shadow Ranch to find a corpse in his driveway. By the time the local sheriffs arrive, the body has disappeared. What happened to the dead man? Who are the mysterious strangers excavating on Adrien's remote property? And will he ever sort out his problems with LAPD Homicide Detective Jake Riordan?",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=JbMSEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 172,
      "author": "Josh Lanyon"
    },
    {
      "title": "Fatal Shadows",
      "publishedDate": "2021-01-07",
      "description": "When a bookstore owner is accused of murdering his ex-lover, proving his innocence might lead a hard-nosed detective to a fatal attraction… Thirty-five-year-old gay bookseller Adrien English searches for love between the pages. As a sensitive intellectual with a heart condition, his dating life is gathering dust on the shelves. But when police name him the prime suspect in the brutal murder of his friend and employee, Adrien doesn't expect his best hope for romance to be assigned to the case… Detective Jake Riordan is hungry to climb the ranks. All he has to do for a promotion is nail the handsome bookstore owner for an obvious crime of passion. If only he could stop fantasizing about the suspect instead of the \"normal\" wife and family his career demands… As Riordan’s investigation heats up and the suspect insists on his innocence, the detective doubts both Adrien's guilt and his ability to resist the man's understated charms. Can they turn the crime into passion, or will a killer on the loose write The End?",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=F7MSEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 173,
      "author": "Josh Lanyon"
    },
    {
      "title": "The Room by the Lake",
      "publishedDate": "2017-07-01",
      "description": "All she wanted was somewhere to belong. Caitlin never meant to stay so long. But it's strange how this place warps time. Out here, in the middle of nowhere, it's easy to forget about the world outside. It all happened so fast. She was lonely, broke, about to give up. Then she met Jake and he took her to his 'family': a close-knit community living by the lake. Each day she says she'll leave but each night she's back around their campfire. Staring into the flames. Reciting in chorus that she is nothing without them. But something inside her won't let go. A whisper that knows this isn't right. Knows there is danger lurking in that quiet room down by the lake... This is a brilliantly atmospheric psychological suspense novel for readers of Emma Cline's The Girls and The Roanoke Girls. Reviews for The Room by the Lake: 'A beautiful book... I was immediately sucked into the writing' NUDGE BOOK. 'A brilliant psychological drama' ALWAYS TRUST IN BOOKS. 'A fascinating, intense psychological suspense novel [...] that really gets under your skin and haunts your thoughts' RATHER TOO FOND OF BOOKS. 'Fast-paced and full of tension' GO BUY THE BOOK. 'Sinister and haunting. A warning about how far people will go when they are lost and lonely. I highly recommend it' BOOKS OF ALL KINDS.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=t7OfEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 174,
      "author": "Emma Dibdin"
    },
    {
      "title": "Mystery at the Masquerade: An M/M Cozy Mystery",
      "publishedDate": "2021-02-28",
      "description": "Love is in the Salt Sea Air--and So is Murder! Ellery Page, aspiring screenwriter, reigning Scrabble champion, and occasionally clueless owner of the village's only mystery bookstore, the Crow’s Nest, is both flattered and bemused when he’s invited to the annual Marauder’s Masquerade, the best and biggest social event of the season in the quaint seaside village of Pirate’s Cove, Rhode Island. The event is hosted by the wealthy Marguerite Bloodworth-Ainsley—a descendant of the famed pirate Tom Blood. Ellery doesn’t even know Mrs. Bloodworth-Ainsley—nor, it turns out—does Mrs. Bloodworth-Ainsley know him. But Marguerite’s son, Julian wants to know Ellery. Julian, handsome, rich and engaging, is a huge mystery buff. In fact, he’s bought quite a few books at the Crow’s Nest bookstore, but never quite worked up the nerve to ask Ellery out. As his relationship with Police Chief Carson seems to be dead in the water, Ellery is grateful for a little flattering attention from the village’s most eligible bachelor, but any hopes of romance hit the shoals when Julian is accused of murdering his mother’s unlikable second husband during the Masquerade's annual ghost hunt in the family’s spooky cemetery.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=YLASEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 175,
      "author": "Josh Lanyon"
    },
    {
      "title": "The Mystery of M. Felix",
      "publishedDate": "2022-09-16",
      "description": "DigiCat Publishing presents to you this special edition of \"The Mystery of M. Felix\" by B. L. Farjeon. DigiCat Publishing considers every written word to be a legacy of humankind. Every DigiCat book has been carefully reproduced for republishing in a new modern format. The books are available in print, as well as ebooks. DigiCat hopes you will treat this work with the acknowledgment and passion it deserves as a classic of world literature.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=m5CKEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 176,
      "author": "B. L. Farjeon"
    },
    {
      "title": "N or M?",
      "publishedDate": "2012-04-17",
      "description": "It is World War II, and while the RAF struggles to keep the Luftwaffe at bay, Britain faces an even more sinister threat from \"the enemy within\"—Nazis posing as ordinary citizens. With pressure mounting, the intelligence service appoints two unlikely spies, Tommy and Tuppence Beresford. Their mission: to seek out a man and a woman from among the colorful guests at Sans Souci, a seaside hotel. But this assignment is no stroll along the promenade—N and M have just murdered Britain's finest agent and no one at all can be trusted. . . .",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=d3ChtQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 177,
      "author": "Agatha Christie"
    },
    {
      "title": "First Class Murder",
      "publishedDate": "2016-02-25",
      "description": "The third instalment in the bestselling Murder Most Unladylike series; just like the iconic Agatha Christie, Hazel and Daisy have boarded the Orient Express! ----- 'A delight . . . Hazel and Daisy are aboard the Orient Express: cue spies, priceless jewels, a murder and seriously upgraded bun breaks' The Bookseller 'Addictive . . . A rumbustious reworking of Agatha Christie's Orient Express caper' New Statesman ----- Daisy Wells and Hazel Wong are taking a holiday on the world-famous Orient Express - and it's clear that each of their fellow first-class passengers has something to hide. Even more intriguing: there is rumour of a spy in their midst. Then, during dinner, there is a scream from inside one of the cabins. When the door is broken down, a passenger is found murdered, her stunning ruby necklace gone. But the killer has vanished - as if into thin air. Daisy and Hazel are faced with their first ever locked-room mystery - and with competition from several other sleuths, who are just as determined to crack the case.",
      "categories": [
        "Juvenile Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=P7p1CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 178,
      "author": "Robin Stevens"
    },
    {
      "title": "The Mystery of Orcival",
      "publishedDate": "1900",
      "description": "",
      "categories": [
        "Monsieur Lecoq (Fictitious character)"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=M-gQAAAAYAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 179,
      "author": "Emile Gaboriau"
    },
    {
      "title": "The Mystery of the Four Fingers",
      "publishedDate": "1908",
      "description": "His whole attention was now concentrated upon Fenwick, who presently tilted his glass of Curacoa dexterously into his coffee cup, and then stretched out his hand for the silver match box by his side. He was still talking to his companion while he fumbled for a match without looking at the little case in his hand. Suddenly he ceased to speak, his black eyes rivetted on the box. It fell from his fingers as if it had contained some poisonous insect, and he rose to his feet with a sudden scream that could be heard all over the room.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=-qQcAAAAMAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 180,
      "author": "Fred Merrick White"
    },
    {
      "title": "R is for Ricochet",
      "publishedDate": "2009-09-18",
      "description": "R is for Ricochet is the eighteenth in the Kinsey Millhone mystery series by Sue Grafton. Kinsey Millhone, employed by Nord Lafferty to drive his daughter home from her incarceration at the Californian Institute for Women, marvels at the simplicity of the task. But Reba Lafferty emerges feisty and rebellious, and Kinsey is soon fighting to prevent her charge from breaking the conditions of her parole. As she finds herself befriending the ex-gambler, ex-alcoholic and ex-con, Kinsey discovers that Reba had taken the fall for her boss, also her lover, when he conducted a highly-crafted money laundering scam. Alan Beckwith has so far escaped the clutches of the FBI. Now they believe he is laundering money for a Columbian drug cartel - they just need the proof. When Kinsey is asked by the police to persuade Reba to unveil crucial evidence guaranteed to put Beckwith behind bars, she doesn’t expect cooperation. But when she hears of shocking new information about her lover, Reba is suddenly all too eager to do everything she can to ruin him. Embroiled in a cunning challenge of wits, and meanwhile bemused by her own blossoming romance, Kinsey must try to control the bitter, angry Reba as she launches her dangerous revenge . . .",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=bHrMLG5UAdgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 181,
      "author": "Sue Grafton"
    },
    {
      "title": "None Shall Sleep",
      "publishedDate": "2020-09-01",
      "description": "The Silence of the Lambs meets Sadie in this riveting psychological thriller about two teenagers teaming up with the FBI to track down juvenile serial killers. In 1982, two teenagers—serial killer survivor Emma Lewis and US Marshal candidate Travis Bell—are recruited by the FBI to interview convicted juvenile killers and provide insight and advice on cold cases. From the start, Emma and Travis develop a quick friendship, gaining information from juvenile murderers that even the FBI can't crack. But when the team is called in to give advice on an active case—a serial killer who exclusively hunts teenagers—things begin to unravel. Working against the clock, they must turn to one of the country's most notorious incarcerated murderers for help: teenage sociopath Simon Gutmunsson. Despite Travis's objections, Emma becomes the conduit between Simon and the FBI team. But while Simon seems to be giving them the information they need to save lives, he's an expert manipulator playing a very long game...and he has his sights set on Emma. Captivating, harrowing, and chilling, None Shall Sleep is an all-too-timely exploration of not only the monsters that live among us but also the monsters that live inside us.",
      "categories": [
        "Young Adult Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=b3HIDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 182,
      "author": "Ellie Marney"
    },
    {
      "title": "The Mystery of the Missing Letter R",
      "publishedDate": "2014-08-04",
      "description": "",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=LtVOBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 183,
      "author": "Judy Kerr"
    },
    {
      "title": "Mystery Walk",
      "publishedDate": "2011-10-18",
      "description": "An “impressive” tale of psychic power, Native American mysticism, and an ancient evil in Alabama, from the New York Times–bestselling author of Swan Song (Associated Press). Born and raised in rural Alabama, Billy Creekmore was destined to be a psychic. His mother, a Choctaw Indian schooled in her tribe’s ancient mysticism, understands the permeable barrier between life and death—and can cross it. She taught the power to Billy and now he helps the dead rest in peace. Wayne Falconer, son of one of the most fervent tent evangelists in the South, travels the country serving his father’s healing ministry. Using his unique powers to cure the flock, Little Wayne is on his way to becoming one of the popular and successful miracle workers in the country. He helps the living survive. Billy and Wayne share more than a gift. They share a dream—and a common enemy. They are on separate journeys, mystery walks that will lead them toward a crossroad where the evil of their dreams has taken shape. One of them will reject the dark. The other will be consumed by it. But neither imagined just how monstrous and far-reaching the dark was, or that mankind’s fate would rest in their hands during an epic showdown of good versus evil. From the author of Gone South, Boy’s Life, and the Matthew Corbett series, a master of suspense who has won the World Fantasy and Bram Stoker Awards, Mystery Walk offers “creepy, subtle touches throughout [and] splendid Southern-town atmosphere” (Kirkus Reviews).",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=gdWyRTRvtIcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 184,
      "author": "Robert McCammon"
    },
    {
      "title": "The Notting Hill Mystery",
      "publishedDate": "2020-08-24",
      "description": "Source documents compiled by insurance investigator Ralph Henderson are used to build a case against Baron \"R___\", who is suspected of murdering his wife. The baron's wife died from drinking a bottle of acid, apparently while sleepwalking in her husband's private laboratory. Henderson's suspicions are raised when he learns that the baron recently had purchased five life insurance policies for his wife. As Henderson investigates the case, he discovers not one but three murders. Although the baron's guilt is clear to the reader even from the outset, how he did it remains a mystery. Eventually this is revealed, but how to catch him becomes the final challenge; he seems to have committed the perfect crime.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=ItxhEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 185,
      "author": "Charles Felix"
    },
    {
      "title": "Greek Fiction",
      "publishedDate": "2013-11-19",
      "description": "First published in 1994. Routledge is an imprint of Taylor & Francis, an informa company.",
      "categories": [
        "History"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=gckeAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 186,
      "author": "]. R. Morgan"
    },
    {
      "title": "Mystery Mechanics, The Creative Process",
      "publishedDate": "2020-08",
      "description": "",
      "categories": [
        "Art"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=R-CuzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 187,
      "author": "Andy Wilkinson"
    },
    {
      "title": "The Jacob Street Mystery",
      "publishedDate": "2017-12-20",
      "description": "A peaceful, pleasant afternoon in the woodland scene of Linton Green is disturbed when a brutal murder takes place. But thanks to an unseen witness, the killer may be caught, and the witness turns out to be a blessing in disguise. This is the story of Thomas Pedley, a gifted artist who paints what he sees from memory.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=3Ld4DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 188,
      "author": "R. Austin Freeman"
    },
    {
      "title": "Mystery of the Haunted Hut",
      "publishedDate": "1969",
      "description": "",
      "categories": [
        "Detective and mystery stories"
      ],
      "price": 600,
      "quantity": 100,
      "image": "noimg",
      "id": 189,
      "author": "Mary Graham Bonner"
    },
    {
      "title": "The Mystery of Edwin Drood Illustrated",
      "publishedDate": "2020-04-15",
      "description": "\"The Mystery of Edwin Drood is the final novel by Charles Dickens.[1][2], originally published in 1870.Though the novel is named after the character Edwin Drood, it focuses more on Drood's uncle, John Jasper, a precentor, choirmaster and opium addict, who is in love with his pupil, Rosa Bud. Miss Bud, Edwin Drood's fiancée, has also caught the eye of the high-spirited and hot-tempered Neville Landless. Landless and Edwin Drood take an instant dislike to one another. Later Drood disappears under mysterious circumstances.\"",
      "categories": "",
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=y-98zQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 190,
      "author": "Charles Dickens"
    },
    {
      "title": "The Tragedy of Y",
      "publishedDate": "2017-12-10",
      "description": "Excerpt from The Tragedy of Y: A Drury Lane Mystery A Dramatic Novel in Prologue, Three Acts, Epilogue, and Explanatory Behind the Scenes. About the Publisher Forgotten Books publishes hundreds of thousands of rare and classic books. Find more at www.forgottenbooks.com This book is a reproduction of an important historical work. Forgotten Books uses state-of-the-art technology to digitally reconstruct the work, preserving the original format whilst repairing imperfections present in the aged copy. In rare cases, an imperfection in the original, such as a blemish or missing page, may be replicated in our edition. We do, however, repair the vast majority of imperfections successfully; any imperfections that remain are intentionally left to preserve the state of such historical works.",
      "categories": "",
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=Z7FxswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 191,
      "author": "Barnaby Ross"
    },
    {
      "title": "Vacation Stories",
      "publishedDate": "2001",
      "description": "A world-famous neurobiologist, Santiago Ramn y Cajal won the Nobel Prize for his scientific research in 1906. The previous year, he published these stories: five ingenious tales that take a microscopic look at the nature, allure, and danger of scientific curiosity. Ramn y Cajal waited almost twenty years to publish these stories because he feared they would compromise his scientific career. Featuring the cutting-edge science of the mid-1880s (microscopy, bacteriology, and hypnosis), they probe the seductive power that proceeds from scientific knowledge and explore how the pursuit of such knowledge alternately redeems and ensnares humanity. Here revenge is disguised as research and common fraud as moral purification. Critical thought vies with moribund tradition and stifling religion for a hold on the human spirit; rigid divisions of class and wealth dissolve before the indiscriminate assault of microbes. One man's faith in science gives him the tools to outwit superstition and win the true love and happiness for which he has sacrificed. that melds the epiphany of A Christmas Carol with the macabre detail of an Edgar Allan Poe story.Now available for the first time in English, Ramn y Cajal's stories reveal a great deal about human nature and the collusion of ambition and greed that prey on the hapless and thoughtless, whether in the name of science, religion, or the state. Laura Otis, whose dual background in literature and science echoes that of the author, has crafted a sparkling translation that captures the wit and imagination of the original.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=Vlyr2v6yiSAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 192,
      "author": "Santiago Ramón y Cajal"
    },
    {
      "title": "Agatha Raisin y el veterinario cruel / The Vicious Vet: An Agatha Raisin Mystery",
      "publishedDate": "2021-11-16",
      "description": "Una autora a la altura de Agatha Christie. Una detective a la altura de Miss Marple. Una serie con todo el misterio, el humor y el countryside británicos. Tras haber desenmascarado al asesino de la quiche letal, la fortuna parece sonreír a Agatha Raisin. Aceptada por la pintoresca comunidad de Carsely, y felizmente acompañada de sus dos gatos, su vida transcurre sin otro objetivo que doblegar la indiferencia de James Lacey, militar jubilado por el que Agatha siente verdadera devoción. Un interés que parece evaporarse cuando aparece en escena Paul Bladen, el nuevo veterinario del pueblo, que no se muestra ajeno a sus encantos. Sin embargo, el hombre sucumbe a una inyección destinada a un caballo de carreras, y aunque todo apunta a un accidente, Agatha cree que se trata de un crimen. Ante la sorpresa de los lugareños, el coronel Lacey comparte, por una vez, la hipótesis de su tenaz vecina, hasta el punto de embarcarse con ella en una investigación mucho más peligrosa de lo que ambos habrían podido imaginar. ENGLISH DESCRIPTION The Vicious Vet continues the tradition in M. C. Beaton's beloved Agatha Raisin cozy mystery series—now a hit show on Acorn TV and public television. A PURR-FECT CRIME IN THE COTSWOLDS Former London PR agent, Agatha Raisin still hasn't adjusted to village life where the only prospect for a hot evening out is a meeting of the Ladies Society. And since her overtures toward James Lacey—the retired military man next door—have failed, Agatha jumps at the chance to visit the new vet, who's single and good-looking. Although Agatha's tabby hasn't a thing wrong with him, Hodge endures having a thermometer shoved up his bum in the name of romance. Unfortunately his sacrifice is all for naught when the vet is soon found dead next to a high-strung horse. The police call the vet's demise a freak accident, but Agatha convinces the hard-to-get James Lacey, who's also bored in the Cotswolds, that playing amateur detective might be fun. Unfortunately, just like curiosity killed the cat, Agatha's inept snooping is soon a motivation for murder...",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=jmKREAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 193,
      "author": "M.C. Beaton"
    },
    {
      "title": "An Old Woman's Tale",
      "publishedDate": "2021-12-02",
      "description": "",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=y-Y5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 194,
      "author": "Натаниель Готорн"
    },
    {
      "title": "Oryx y Crake",
      "publishedDate": "2021-07-06",
      "description": "«Ingeniosa y perturbadora [...]. Una obra crucial de la ficción especulativa.» Kirkus Reviews Sometida a los estragos de una terrible plaga, la humanidad afronta una dura y azarosa huida hacia delante. En esta primera entrega de la trilogía de MADDADDAM -que se completa con El año del Diluvio y Maddaddam-, Margaret Atwood nos invita nuevamente a adentrarnos en un mundo futuro tan verosímil como inquietante, elemento esencial del universo narrativo de la célebre autora de El cuento de la criada. Conocido como Jimmy antes de que el planeta se viese asolado por una serie de desastres naturales, Hombre de las Nieves llora la pérdida de Crake, su mejor amigo, y de la bella y esquiva Oryx, de quien ambos estaban enamorados, mientras lucha por sobrevivir en soledad sobre la faz de la Tierra. A merced de los elementos, acechado por los recuerdos y sin más compañía que la de los Hijos de Crake, esos seres de ojos verdes que lo consideran una especie de profeta, Hombre de las Nieves se pregunta cómo ha podido cambiar todo en tan poco tiempo y emprende un doble viaje hacia su pasado y hacia la burbuja de alta tecnología creada por Crake, el lugar donde empezó todo. Mediante una historia de amor inolvidable, Margaret Atwood aborda de forma satírica los avances de la manipulación genética y nos traslada a un futuro aterradoramente plausible que reside en el límite de lo imaginable.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "noimg",
      "id": 195,
      "author": "Margaret Eleanor Atwood"
    },
    {
      "title": "Bella y oscura",
      "publishedDate": "2006",
      "description": "La historia de la infancia, vivida y soñada, de una niña que viajará desde la soledad del orfanato hasta el marginal Barrio donde la acoge su singular familia, de poderosa e intrigante personalidad. Relato alegórico de lo que poseemos sin haber conquistado: la sabiduría de la infancia.",
      "categories": [
        "Children"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=tcWMPAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 196,
      "author": "Rosa Montero"
    },
    {
      "title": "Bricks Without Straw (a Novel)",
      "publishedDate": "2006-06-01",
      "description": "",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=Y-NaPwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 197,
      "author": "W. Albion Tourgee"
    },
    {
      "title": "Fflur",
      "publishedDate": "2019-12-11",
      "description": "Dyma raghanes i Y DAur. Nofel wedi ei lleoli yn y Gymru wledig am gariad a rhamant gydag elfennau goruwchnaturiol wedi plethu i'r cwbl. Dilynir Eirlys, morwyn sy'n gweithio ar fferm Dolfrwynog, sy'n gwylio ac yn cofnodi pob hanesyn a mynd a dod yn ei chymuned yng Nghwm y Blodau rhwng y ddau ryfel byd.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=I59IEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 198,
      "author": "Lloyd Jones"
    },
    {
      "title": "The Boss of the Lazy Y",
      "publishedDate": "2015-05-09",
      "description": "\"The Boss of the Lazy Y\" from Charles Alden Seltzer. American writer, prolific author of western novels (1875-1942).",
      "categories": "",
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=atCCrgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 199,
      "author": "Charles Alden Seltzer"
    },
    {
      "title": "Q's Mystery Stories",
      "publishedDate": "2021-08-30",
      "description": "\"Q's Mystery Stories\" by Arthur Thomas Quiller-Couch. Published by Good Press. Good Press publishes a wide range of titles that encompasses every genre. From well-known classics & literary fiction and non-fiction to forgotten−or yet undiscovered gems−of world literature, we issue the books that need to be read. Each Good Press edition has been meticulously edited and formatted to boost readability for all e-readers and devices. Our goal is to produce eBooks that are user-friendly and accessible to everyone in a high-quality digital format.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=iK9BEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 200,
      "author": "Arthur Thomas Quiller-Couch"
    },
    {
      "title": "The Long Count",
      "publishedDate": "2016-05-03",
      "description": "A page-turning psychological puzzle for fans of Shutter Island and True Detective 'The detail is unerring ... and this magisterial grasp of time and place lends the story vivid veracity. The characters leap off the page and the plotting is faultless.' JOHN BOORMAN (Director of Point Blank and Deliverance) 'I loved this book: it has such a subtle sense of place, the clear writing pulls you in right from the start, and its ingenious plot line is both shocking and inevitable.' ANN CLEEVES In the late 1960s, with America at war in Vietnam, John Q is an old school Texas Ranger - a gun on each hip and quick on the draw. Called to the apparent suicide of a fellow war veteran, John Q suspects all is not as it seems, and very soon faces a desperate race across state as he starts to uncover just how dark some secrets can be.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=KyBxCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 201,
      "author": "JM Gulvin"
    },
    {
      "title": "The Contract",
      "publishedDate": "2017-04-04",
      "description": "In New Orleans, Texas Ranger John Q is out of his jurisdiction, and possibly out of his depth. It seems everyone in Louisiana wants to send him home, and every time he asks questions there's trouble: from the pharmacist to the detective running scared to the pimp who turned to him as a last resort. Before John Q knows it, he looks the only link between a series of murders.So who could be trying to set him up, and why, and who can he turn to in a city where Southern tradition and family ties rule?Infused with the rhythms of its iconic setting, The Contract is a thriller to keep even the most seasoned crime readers gripped and guessing all the way to its endgame.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=2BWmDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 202,
      "author": "JM Gulvin"
    },
    {
      "title": "Q's Mystery Stories",
      "publishedDate": "1948",
      "description": "",
      "categories": [
        "Short stories"
      ],
      "price": 600,
      "quantity": 100,
      "image": "noimg",
      "id": 203,
      "author": "Arthur Quiller-Couch"
    },
    {
      "title": "The Real Story of Ah-Q and Other Tales of China",
      "publishedDate": "2009-10-29",
      "description": "Lu Xun (Lu Hsun) is arguably the greatest writer of modern China, and is considered by many to be the founder of modern Chinese literature. Lu Xun's stories both indict outdated Chinese traditions and embrace China's cultural richness and individuality. This volume presents brand-new translations by Julia Lovell of all of Lu Xun's stories, including 'The Real Story of Ah-Q', 'Diary of a Madman', 'A Comedy of Ducks', 'The Divorce' and 'A Public Example', among others. With an afterword by Yiyun Li.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=C3GOr00uS8UC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 204,
      "author": "Lu Xun"
    },
    {
      "title": "The Sacramental Mystery",
      "publishedDate": "1999",
      "description": "The seven sacraments lie at the centre of Christian life and experience, for here God the Holy Trinity touches human lives and hearts. This book is one of the few at the present time to offer a global synthesis of the main themes in the sacramental mystery in which the human and divine, the material and the spiritual realms are intimately intertwined. Paul Haffner outlines how the sacraments are the chief means in the Church through which God's people are reconciled to the Father, through His Son, by the power of the Holy Spirit. The book illustrates classical issues like the conditions for the validity and the efficacy of the sacraments, as well as the minister, recipient and effects of these sacred mysteries; it deals with particular topics like the necessity of Baptism, the sacrificial character of the Eucharist, and the nature of marriage. As he examines each sacrament in turn, the author also explores how new ecumenical questions affect Christian sacramental understanding. 'I warmly commend this work on the subject of sacramental theology' Archbishop Csaba Ternyak Secretary of the Vatican Congregation of the Clergy Paul Haffner is lecturer in systematic and dogmatic theology at the Pontifical Gregorian University, the Pontifical Lateran University, the Pontifical Athenaeum 'Regina Apostolorum' and the Pontifical Institute 'Regina Mundi' in Rome. His publications include 'The Mystery of Creation', 'The Mystery of Reason' and 'The Mystery of Mary' - all also published by Gracewing.",
      "categories": [
        "Religion"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=Q-2CRzlijgwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 205,
      "author": "Paul Haffner"
    },
    {
      "title": "The Rotary Club Murder Mystery",
      "publishedDate": "1996-04-15",
      "description": "Eighty-eight-year-old Harriet Bushrow and sister DAR members of Borverville, Tennessee, become entangled in a case involving the district governor of a North Carolina Rotary Club, found shot dead in his hotel room",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=Q-AILx80KigC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 206,
      "author": "Graham Landrum"
    },
    {
      "title": "Q",
      "publishedDate": "2012-07-01",
      "description": "In a gripping tale of time travel and true love that will appeal to fans of 'The Time Traveller's Wife' and 'The Adventures of Max Tivoli', a successful writer meets his future self, who advises him not to marry Q, the love of his life.",
      "categories": [
        "Love stories"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=wz1otQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 207,
      "author": "Evan J. Mandery"
    },
    {
      "title": "Soliloquy in Nineteenth-Century Fiction",
      "publishedDate": "2014-01-14",
      "description": "",
      "categories": [
        "Literary Criticism"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=q-94jwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 208,
      "author": "C. Mackay"
    },
    {
      "title": "The Hanging Girl",
      "publishedDate": "2015-09-08",
      "description": "New York Times and internationally bestselling author Jussi Adler-Olsen delivers an exhilarating mystery in the Department Q series, featuring Detective Carl Mørck and his enigmatic assistants, Assad and Rose. In the middle of his usual hard-won morning nap in the basement of police headquarters, Carl Mørck, head of Department Q, receives a call from a colleague working on the Danish island of Bornholm. Carl is dismissive when he realizes that a new case is being foisted on him, but a few hours later, he receives some shocking news that leaves his headstrong assistant Rose more furious than usual. Carl has no choice but to lead Department Q into the tragic cold case of a vivacious seventeen-year-old girl who vanished from school, only to be found dead hanging high up in a tree. The investigation will take them from the remote island of Bornholm to a strange sun-worshipping cult, where Carl, Assad, Rose, and newcomer Gordon attempt to stop a string of new murders and a skilled manipulator who refuses to let anything—or anyone—get in the way.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=A9dJBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 209,
      "author": "Jussi Adler-Olsen"
    },
    {
      "title": "The Mystery of Edwin Drood Illustrated",
      "publishedDate": "2020-04-15",
      "description": "\"The Mystery of Edwin Drood is the final novel by Charles Dickens.[1][2], originally published in 1870.Though the novel is named after the character Edwin Drood, it focuses more on Drood's uncle, John Jasper, a precentor, choirmaster and opium addict, who is in love with his pupil, Rosa Bud. Miss Bud, Edwin Drood's fiancée, has also caught the eye of the high-spirited and hot-tempered Neville Landless. Landless and Edwin Drood take an instant dislike to one another. Later Drood disappears under mysterious circumstances.\"",
      "categories": "",
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=y-98zQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 210,
      "author": "Charles Dickens"
    },
    {
      "title": "The Tragedy of Y",
      "publishedDate": "2017-12-10",
      "description": "Excerpt from The Tragedy of Y: A Drury Lane Mystery A Dramatic Novel in Prologue, Three Acts, Epilogue, and Explanatory Behind the Scenes. About the Publisher Forgotten Books publishes hundreds of thousands of rare and classic books. Find more at www.forgottenbooks.com This book is a reproduction of an important historical work. Forgotten Books uses state-of-the-art technology to digitally reconstruct the work, preserving the original format whilst repairing imperfections present in the aged copy. In rare cases, an imperfection in the original, such as a blemish or missing page, may be replicated in our edition. We do, however, repair the vast majority of imperfections successfully; any imperfections that remain are intentionally left to preserve the state of such historical works.",
      "categories": "",
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=Z7FxswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 211,
      "author": "Barnaby Ross"
    },
    {
      "title": "Vacation Stories",
      "publishedDate": "2001",
      "description": "A world-famous neurobiologist, Santiago Ramn y Cajal won the Nobel Prize for his scientific research in 1906. The previous year, he published these stories: five ingenious tales that take a microscopic look at the nature, allure, and danger of scientific curiosity. Ramn y Cajal waited almost twenty years to publish these stories because he feared they would compromise his scientific career. Featuring the cutting-edge science of the mid-1880s (microscopy, bacteriology, and hypnosis), they probe the seductive power that proceeds from scientific knowledge and explore how the pursuit of such knowledge alternately redeems and ensnares humanity. Here revenge is disguised as research and common fraud as moral purification. Critical thought vies with moribund tradition and stifling religion for a hold on the human spirit; rigid divisions of class and wealth dissolve before the indiscriminate assault of microbes. One man's faith in science gives him the tools to outwit superstition and win the true love and happiness for which he has sacrificed. that melds the epiphany of A Christmas Carol with the macabre detail of an Edgar Allan Poe story.Now available for the first time in English, Ramn y Cajal's stories reveal a great deal about human nature and the collusion of ambition and greed that prey on the hapless and thoughtless, whether in the name of science, religion, or the state. Laura Otis, whose dual background in literature and science echoes that of the author, has crafted a sparkling translation that captures the wit and imagination of the original.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=Vlyr2v6yiSAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 212,
      "author": "Santiago Ramón y Cajal"
    },
    {
      "title": "Agatha Raisin y el veterinario cruel / The Vicious Vet: An Agatha Raisin Mystery",
      "publishedDate": "2021-11-16",
      "description": "Una autora a la altura de Agatha Christie. Una detective a la altura de Miss Marple. Una serie con todo el misterio, el humor y el countryside británicos. Tras haber desenmascarado al asesino de la quiche letal, la fortuna parece sonreír a Agatha Raisin. Aceptada por la pintoresca comunidad de Carsely, y felizmente acompañada de sus dos gatos, su vida transcurre sin otro objetivo que doblegar la indiferencia de James Lacey, militar jubilado por el que Agatha siente verdadera devoción. Un interés que parece evaporarse cuando aparece en escena Paul Bladen, el nuevo veterinario del pueblo, que no se muestra ajeno a sus encantos. Sin embargo, el hombre sucumbe a una inyección destinada a un caballo de carreras, y aunque todo apunta a un accidente, Agatha cree que se trata de un crimen. Ante la sorpresa de los lugareños, el coronel Lacey comparte, por una vez, la hipótesis de su tenaz vecina, hasta el punto de embarcarse con ella en una investigación mucho más peligrosa de lo que ambos habrían podido imaginar. ENGLISH DESCRIPTION The Vicious Vet continues the tradition in M. C. Beaton's beloved Agatha Raisin cozy mystery series—now a hit show on Acorn TV and public television. A PURR-FECT CRIME IN THE COTSWOLDS Former London PR agent, Agatha Raisin still hasn't adjusted to village life where the only prospect for a hot evening out is a meeting of the Ladies Society. And since her overtures toward James Lacey—the retired military man next door—have failed, Agatha jumps at the chance to visit the new vet, who's single and good-looking. Although Agatha's tabby hasn't a thing wrong with him, Hodge endures having a thermometer shoved up his bum in the name of romance. Unfortunately his sacrifice is all for naught when the vet is soon found dead next to a high-strung horse. The police call the vet's demise a freak accident, but Agatha convinces the hard-to-get James Lacey, who's also bored in the Cotswolds, that playing amateur detective might be fun. Unfortunately, just like curiosity killed the cat, Agatha's inept snooping is soon a motivation for murder...",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=jmKREAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 213,
      "author": "M.C. Beaton"
    },
    {
      "title": "An Old Woman's Tale",
      "publishedDate": "2021-12-02",
      "description": "",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=y-Y5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 214,
      "author": "Натаниель Готорн"
    },
    {
      "title": "Oryx y Crake",
      "publishedDate": "2021-07-06",
      "description": "«Ingeniosa y perturbadora [...]. Una obra crucial de la ficción especulativa.» Kirkus Reviews Sometida a los estragos de una terrible plaga, la humanidad afronta una dura y azarosa huida hacia delante. En esta primera entrega de la trilogía de MADDADDAM -que se completa con El año del Diluvio y Maddaddam-, Margaret Atwood nos invita nuevamente a adentrarnos en un mundo futuro tan verosímil como inquietante, elemento esencial del universo narrativo de la célebre autora de El cuento de la criada. Conocido como Jimmy antes de que el planeta se viese asolado por una serie de desastres naturales, Hombre de las Nieves llora la pérdida de Crake, su mejor amigo, y de la bella y esquiva Oryx, de quien ambos estaban enamorados, mientras lucha por sobrevivir en soledad sobre la faz de la Tierra. A merced de los elementos, acechado por los recuerdos y sin más compañía que la de los Hijos de Crake, esos seres de ojos verdes que lo consideran una especie de profeta, Hombre de las Nieves se pregunta cómo ha podido cambiar todo en tan poco tiempo y emprende un doble viaje hacia su pasado y hacia la burbuja de alta tecnología creada por Crake, el lugar donde empezó todo. Mediante una historia de amor inolvidable, Margaret Atwood aborda de forma satírica los avances de la manipulación genética y nos traslada a un futuro aterradoramente plausible que reside en el límite de lo imaginable.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "noimg",
      "id": 215,
      "author": "Margaret Eleanor Atwood"
    },
    {
      "title": "Bella y oscura",
      "publishedDate": "2006",
      "description": "La historia de la infancia, vivida y soñada, de una niña que viajará desde la soledad del orfanato hasta el marginal Barrio donde la acoge su singular familia, de poderosa e intrigante personalidad. Relato alegórico de lo que poseemos sin haber conquistado: la sabiduría de la infancia.",
      "categories": [
        "Children"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=tcWMPAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 216,
      "author": "Rosa Montero"
    },
    {
      "title": "Bricks Without Straw (a Novel)",
      "publishedDate": "2006-06-01",
      "description": "",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=Y-NaPwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 217,
      "author": "W. Albion Tourgee"
    },
    {
      "title": "Fflur",
      "publishedDate": "2019-12-11",
      "description": "Dyma raghanes i Y DAur. Nofel wedi ei lleoli yn y Gymru wledig am gariad a rhamant gydag elfennau goruwchnaturiol wedi plethu i'r cwbl. Dilynir Eirlys, morwyn sy'n gweithio ar fferm Dolfrwynog, sy'n gwylio ac yn cofnodi pob hanesyn a mynd a dod yn ei chymuned yng Nghwm y Blodau rhwng y ddau ryfel byd.",
      "categories": [
        "Fiction"
      ],
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=I59IEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "id": 218,
      "author": "Lloyd Jones"
    },
    {
      "title": "The Boss of the Lazy Y",
      "publishedDate": "2015-05-09",
      "description": "\"The Boss of the Lazy Y\" from Charles Alden Seltzer. American writer, prolific author of western novels (1875-1942).",
      "categories": "",
      "price": 600,
      "quantity": 100,
      "image": "http://books.google.com/books/content?id=atCCrgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "id": 219,
      "author": "Charles Alden Seltzer"
    }
  ]